package hw_26;

public class Quiz {

    /*
    С помощью какого механизма избежать дублирование кода в двух разных классах?
    - Наследование

    С помощью какого ключевого слова мы наследуемся
    - extends

    A extands B - где предок / потомок ?
    B - предок
    A - потомок

    С помощью какого модификатора можно сделать так, что метод или поле были доступны в потомке?
    - protected
    - public

    Какие элементы класса-предка (родителя) копируются в класс-потомок?
    - поля
    - методы
    - НЕ копируется конструкторы

    Как принудительно вызвать конструктор предка в конструкторе потомка?
    - super()

    Что будет, если в конструкторе потомке не вызвать явно конструктор предка?
    - Java попытается вызвать пустой конструктор предка (super())
    А если такого конструктора нет - будет ошибка компиляции - программа не запуститься

     */
}
